#include <REGX52.H>
#include <intrins.h>
sbit RCK = P3^5;
sbit SCK = P3^6;
sbit SER = P3^4;

/*
 *使用前请先使用初始化函数，否则点阵显示会出现问题
 */

/*******************************************************************************
* 函数名         : Delay150us()
* 函数功能		 : 延时150微秒
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/

void Delay150us()		//@12.000MHz
{
	unsigned char i, j;

	i = 2;
	j = 189;
	do
	{
		while (--j);
	} while (--i);
}


/*******************************************************************************
* 函数名         : Delay()
* 函数功能		 : 延时函数
* 输入           : xms 0~65535
* 输出         	 : 无
*******************************************************************************/
void Delay(unsigned int xms)		
{
	while(xms--){
	unsigned char i, j;

	i = 12;
	j = 169;
	do
	{
		while (--j);
	} while (--i);
	}
}
/*******************************************************************************
* 函数名         : hand_message()
* 函数功能		 : 在74hc595中将数据移动到数据存储寄存器
* 输入           : Byte 0~255
* 输出         	 : 无
*******************************************************************************/
void hand_message(unsigned char Byte){
	unsigned char i;
	for(i = 0; i < 8;i ++)
	{	
		SER = 0x80 & (Byte << i);
		SCK = 1;
		SCK = 0;

	}
	RCK = 1;
	RCK = 0;
}
/*******************************************************************************
* 函数名         : led_show()
* 函数功能		 : 获取要显示的列的位置同时将需要显示的数据传递给hand_message
* 输入           : location 0~7	  0在最左面
* 输入			 ：Byte 0~255
* 输出         	 : 无
*******************************************************************************/
void led_show(unsigned char location,Byte){
	  hand_message(Byte);
	  P0 = ~(0x80 >> location);
	  Delay150us();
	  P0 = 0xff;

}
/*******************************************************************************
* 函数名         : led_Anim1()
* 函数功能		 : 以流动的形式显示图形(从右向左)
* 输入			 ：animation 一维字符数组  
* 输入			 : length 数组长度 0~65535
* 输出         	 : 无
*******************************************************************************/
void led_Anim1(char *animation,unsigned int length)	
{	
	unsigned char i,j = 0;

	while(1)
	{

		for(i  = 0;i < 8;i ++)
		{
			led_show(i,animation[i + j]);
		}
		//Delay(10);
		j ++;
		if(j > length - 8)
			j = 0;	

	
	}
}

/*******************************************************************************
* 函数名         : led_Anim2()
* 函数功能		 : 以动画的形式显示图案
* 输入			 ：animation 一维字符数组  
* 输入			 : length 数组长度 0~65535
* 输出         	 : 无
*******************************************************************************/
void led_Anim2(char *animation,unsigned int length)
{
	unsigned char i,j;
	while(1)
	{

		for(i  = 0;i < 8;i ++)
		{
			led_show(i,animation[i + j]);
		}
		Delay(10);
		j += 8;
		if(j > length - 8)
			j = 0;
	}	
}
/*******************************************************************************
* 函数名         : led_init()
* 函数功能		 : 初始化led点阵
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void led_init()
{
	SCK = 0; //推动
	RCK = 0; //整体移动
}
